Revit 2024 API
AreaLoad.SetLoops Method
 Sets curve loops that define geometry of the area load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool SetLoops(
	Document doc,
	IList<CurveLoop> newLoops
)
Visual Basic
Public Function SetLoops ( _
	doc As Document, _
	newLoops As IList(Of CurveLoop) _
) As Boolean
Visual C++
public:
bool SetLoops(
	Document^ doc,
	IList<CurveLoop^>^ newLoops
)
Parameters
doc
Type: Autodesk.Revit.DB.Document
 The document that contains the area load.
newLoops
Type: System.Collections.Generic.IList<CurveLoop>
 Loops that define new geometry of the area load. The curve loop collection should contains a closed loops consisting of lines.
Return Value
 Returns true if successful, false otherwise.
Remarks
 This method works for loads which are not constrained to their host. This method works with hosted area load only. All previously defined reference points will be removed. Curve Loop must be planar and not self-intersecting.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  One of the following requirements is not satisfied : - curve loops newLoops are not planar - curve loops newLoops are self-intersecting - curve loops newLoops contains zero length curves -or- Thrown when newLoops collection is empty. -or- Thrown when newLoops contains open loop. -or- Thrown when newLoops contains a loop consisting of other elements then lines.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  This AreaLoad is not a hosted load. -or- This AreaLoad is a constrained load.
See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace